vlm/extension/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ЭтапПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЭтапПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АльтернативныеВидыРабочихЦентров</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыРабочихЦентров</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Catalogs/ТехнологическиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТехнологическиеОперации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Загрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Непрерывная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МожноПропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередаточнаяПартия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСледующейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяПЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяШтучное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТехнологическийПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеПроцессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяПЗЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контроль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантНаладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНаладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяШтучноеЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МожноПовторить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентТехнологическогоПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВспомогательныеРабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/extension/CommonModules/бит_ВидыРабочихЦентров/Ext/Module.bsl
Функция ОпределитьСпецификации(знач ОсновноеИзделиеНоменклатура, знач Оборудование, знач КодОперации) Экспорт          
// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 20:01:59] +        
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭтапыПроизводства.Владелец КАК РесурснаяСпецификация
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО ТехнологическиеОперации.Владелец = ЭтапыПроизводства.Ссылка
		|			И (НЕ ЭтапыПроизводства.ПометкаУдаления)
		|			И (ЭтапыПроизводства.НомерСледующегоЭтапа = 0)
		|			И (ЭтапыПроизводства.Владелец.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
		|ГДЕ
		|	(ЭтапыПроизводства.ВидыРабочихЦентров.ВидРабочегоЦентра = &Оборудование
		|			ИЛИ ЭтапыПроизводства.АльтернативныеВидыРабочихЦентров.ВидРабочегоЦентра = &Оборудование)
		|	И ТехнологическиеОперации.НомерСледующейОперации = 0
		|	И НЕ ТехнологическиеОперации.ПометкаУдаления
		|	И ТехнологическиеОперации.Спецификация.ОсновноеИзделиеНоменклатура = &ОсновноеИзделиеНоменклатура
		|	И ТехнологическиеОперации.бит_КодОперации = &КодОперации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапыПроизводства.Владелец.НачалоДействия УБЫВ");
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", ОсновноеИзделиеНоменклатура);
	Запрос.УстановитьПараметр("КодОперации", КодОперации);
	
	Массив = новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.РесурснаяСпецификация);
	КонецЦикла;
	
	Возврат Массив;
// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 20:01:59] -	
КонецФункции  

// возвращает соответствие вида ключ  - ВРЦ, значение - мин. дата доступности
//
Функция ОпределитьДоступноеОборудованиеНаСервере(знач мСпецификаций, ТолькоОборудование = Ложь) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 18:48:09] +        
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура
	                      |ПОМЕСТИТЬ втОсновноеИзделиеНоменклатура
	                      |ИЗ
	                      |	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	                      |ГДЕ
	                      |	РесурсныеСпецификации.Ссылка В(&мСпецификаций)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЭтапыПроизводства.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ втЭтапСправочник
	                      |ИЗ
	                      |	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	                      |ГДЕ
	                      |	ЭтапыПроизводства.Владелец В(&мСпецификаций)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ТехнологическиеОперации.бит_КодОперации КАК бит_КодОперации
	                      |ПОМЕСТИТЬ вт_ТехнологическаяОперацияЭтап
	                      |ИЗ
	                      |	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЭтапСправочник КАК втЭтапСправочник
	                      |		ПО (втЭтапСправочник.Ссылка = ТехнологическиеОперации.Владелец)
	                      |ГДЕ
	                      |	ТехнологическиеОперации.Спецификация В(&мСпецификаций)
	                      |	И ТехнологическиеОперации.Спецификация.ОсновноеИзделиеНоменклатура В
	                      |			(ВЫБРАТЬ
	                      |				втОсновноеИзделиеНоменклатура.ОсновноеИзделиеНоменклатура
	                      |			ИЗ
	                      |				втОсновноеИзделиеНоменклатура КАК втОсновноеИзделиеНоменклатура)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ТехнологическиеОперации.Спецификация КАК Спецификация
	                      |ПОМЕСТИТЬ вт_СпецификацииПоКодуОперации
	                      |ИЗ
	                      |	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	                      |ГДЕ
	                      |	ТехнологическиеОперации.бит_КодОперации В
	                      |			(ВЫБРАТЬ
	                      |				вт_ТехнологическаяОперацияЭтап.бит_КодОперации КАК бит_КодОперации
	                      |			ИЗ
	                      |				вт_ТехнологическаяОперацияЭтап КАК вт_ТехнологическаяОперацияЭтап)
	                      |	И ТехнологическиеОперации.Спецификация.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
	                      |	И ТехнологическиеОперации.Спецификация.ОсновноеИзделиеНоменклатура В
	                      |			(ВЫБРАТЬ
	                      |				втОсновноеИзделиеНоменклатура.ОсновноеИзделиеНоменклатура
	                      |			ИЗ
	                      |				втОсновноеИзделиеНоменклатура КАК втОсновноеИзделиеНоменклатура)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЭтапыПроизводстваВидыРабочихЦентров.ВидРабочегоЦентра КАК ВидРабочегоЦентра
	                      |ИЗ
	                      |	Справочник.ЭтапыПроизводства.ВидыРабочихЦентров КАК ЭтапыПроизводстваВидыРабочихЦентров
	                      |ГДЕ
	                      |	ЭтапыПроизводстваВидыРабочихЦентров.Ссылка.Владелец В
	                      |			(ВЫБРАТЬ
	                      |				вт_СпецификацииПоКодуОперации.Спецификация КАК Спецификация
	                      |			ИЗ
	                      |				вт_СпецификацииПоКодуОперации КАК вт_СпецификацииПоКодуОперации)
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЭтапыПроизводстваАльтернативныеВидыРабочихЦентров.ВидРабочегоЦентра
	                      |ИЗ
	                      |	Справочник.ЭтапыПроизводства.АльтернативныеВидыРабочихЦентров КАК ЭтапыПроизводстваАльтернативныеВидыРабочихЦентров
	                      |ГДЕ
	                      |	ЭтапыПроизводстваАльтернативныеВидыРабочихЦентров.Ссылка.Владелец В
	                      |			(ВЫБРАТЬ
	                      |				вт_СпецификацииПоКодуОперации.Спецификация КАК Спецификация
	                      |			ИЗ
	                      |				вт_СпецификацииПоКодуОперации КАК вт_СпецификацииПоКодуОперации)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВидРабочегоЦентра");
	
	Запрос.УстановитьПараметр("мСпецификаций", мСпецификаций);
	//Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", Спецификация.ОсновноеИзделиеНоменклатура);
	
	мВРЦ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРабочегоЦентра");
	Если ТолькоОборудование Тогда
		Возврат мВРЦ;
	КонецЕсли;
	
	Соответствие = ПолучитьМинимальныеДатыДоступностиВРЦ(мВРЦ);
	
	Возврат Соответствие; 
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 18:48:09] -
КонецФункции   

Функция ПолучитьМинимальныеДатыДоступностиВРЦ(МассивВРЦ, НачалоПериода = Неопределено, ОкончаниеПериода = Неопределено) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [27.04.2026 19:03:37] +        
	Результат = Новый Соответствие;
	
	Если МассивВРЦ = Неопределено Или МассивВРЦ.Количество() = 0 Тогда
		Возврат МассивВРЦ;
	КонецЕсли;
	
	Если НачалоПериода = Неопределено Тогда
		НачалоПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	Если ОкончаниеПериода = Неопределено Тогда
		ОкончаниеПериода = ДобавитьМесяц(КонецМесяца(НачалоПериода), 6);
	КонецЕсли;
	ТЗ = СформироватьВнешниеНаборыДанных(МассивВРЦ, НачалоПериода, ОкончаниеПериода);
	
	// определим минимальный интервал
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	ДанныеОЗагрузке.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	                      |	ДанныеОЗагрузке.ПериодГрафика КАК ПериодГрафика,
	                      |	ДанныеОЗагрузке.УчитыватьДоступность КАК УчитыватьДоступность,
	                      |	ДанныеОЗагрузке.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
	                      |	ДанныеОЗагрузке.Доступно / 60 КАК Доступно,
	                      |	ДанныеОЗагрузке.Занято / 60 КАК Занято
	                      |ПОМЕСТИТЬ ДанныеОЗагрузке0
	                      |ИЗ
	                      |	&ДанныеОЗагрузке КАК ДанныеОЗагрузке
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДанныеОЗагрузке0.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	                      |	ДанныеОЗагрузке0.ПериодГрафика КАК ПериодГрафика,
	                      |	ДанныеОЗагрузке0.УчитыватьДоступность КАК УчитыватьДоступность,
	                      |	ДанныеОЗагрузке0.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
	                      |	МАКСИМУМ(ДанныеОЗагрузке0.Доступно) КАК Доступно,
	                      |	СУММА(ДанныеОЗагрузке0.Занято) КАК Занято
	                      |ПОМЕСТИТЬ ДанныеОЗагрузке
	                      |ИЗ
	                      |	ДанныеОЗагрузке0 КАК ДанныеОЗагрузке0
	                      |ГДЕ
	                      |	ДанныеОЗагрузке0.ВидРабочегоЦентра В(&СписокВРЦ)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДанныеОЗагрузке0.ВидРабочегоЦентра,
	                      |	ДанныеОЗагрузке0.ПараллельнаяЗагрузка,
	                      |	ДанныеОЗагрузке0.ПериодГрафика,
	                      |	ДанныеОЗагрузке0.УчитыватьДоступность
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДанныеОЗагрузке.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	                      |	МИНИМУМ(ДанныеОЗагрузке.ПериодГрафика) КАК БлижайшаяДата,
	                      |	МАКСИМУМ(ДанныеОЗагрузке.Доступно) КАК Доступно,
	                      |	СУММА(ДанныеОЗагрузке.Занято) КАК Занято
						  //|ПОМЕСТИТЬ Почти
	                      |ИЗ
	                      |	ДанныеОЗагрузке КАК ДанныеОЗагрузке
	                      |ГДЕ
	                      |	(НЕ ДанныеОЗагрузке.ПараллельнаяЗагрузка
	                      |				И ДанныеОЗагрузке.Доступно > ДанныеОЗагрузке.Занято
	                      |			ИЛИ ДанныеОЗагрузке.ПараллельнаяЗагрузка
	                      |				И ДанныеОЗагрузке.Доступно <> 0
	                      |				И ДанныеОЗагрузке.Занято < ДанныеОЗагрузке.Доступно)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДанныеОЗагрузке.ВидРабочегоЦентра
						  |");
	                      //|;
	                      //|
	                      //|////////////////////////////////////////////////////////////////////////////////
						  //|ВЫБРАТЬ
						  //|	Почти.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
						  //|	Почти.БлижайшаяДата КАК БлижайшаяДата,
						  //|	Почти.Доступно - Почти.Занято КАК СвободноМинут
						  //|ИЗ
						  //|	Почти КАК Почти");
	Запрос.УстановитьПараметр("ДанныеОЗагрузке", ТЗ); 
	
	СписокВРЦ = новый СписокЗначений;
	СписокВРЦ.ЗагрузитьЗначения(МассивВРЦ);
	Запрос.УстановитьПараметр("СписокВРЦ", СписокВРЦ);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ВидРабочегоЦентра, Новый Структура("Дата, ДоступноМинут", Выборка.БлижайшаяДата + (Выборка.Занято * 60), Выборка.Доступно - Выборка.Занято));	
	КонецЦикла; 
	
	// дополним врц по которым нет данных
	Для каждого стр из МассивВРЦ Цикл
		Если Результат.Получить(стр) = Неопределено Тогда
			Результат.Вставить(стр, Новый Структура("Дата, ДоступноМинут"));  
		КонецЕсли;
	КонецЦикла;
		
	Возврат Результат;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [27.04.2026 19:03:37] -	
КонецФункции

Функция СформироватьВнешниеНаборыДанных(СписокВРЦ, НачалоПериода, ОкончаниеПериода)
	// Функция взята из отчета ЗагруженностьвидовРабочихЦентров
	
	МассивТипов = Новый Массив;
	//++ Локализация
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказНаПроизводство"));
	//-- Локализация
	МассивТипов.Добавить(Тип("ДокументСсылка.ЭтапПроизводства2_2"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказНаПроизводство2_2"));
	ОТРаспоряжение = Новый ОписаниеТипов(МассивТипов);
	
	ДанныеОЗагрузке = Новый ТаблицаЗначений;
	ДанныеОЗагрузке.Колонки.Добавить("Подразделение",              Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ДанныеОЗагрузке.Колонки.Добавить("ВидРабочегоЦентра",          Новый ОписаниеТипов("СправочникСсылка.ВидыРабочихЦентров"));
	ДанныеОЗагрузке.Колонки.Добавить("ВариантНаладки",             Новый ОписаниеТипов("СправочникСсылка.ВариантыНаладки"));
	ДанныеОЗагрузке.Колонки.Добавить("Доступно",                   Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15)));
	ДанныеОЗагрузке.Колонки.Добавить("Занято",                     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15)));
	ДанныеОЗагрузке.Колонки.Добавить("Номенклатура",               Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеОЗагрузке.Колонки.Добавить("Характеристика",             Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ДанныеОЗагрузке.Колонки.Добавить("Количество",                 Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ДанныеОЗагрузке.Колонки.Добавить("ПериодГрафика",              Новый ОписаниеТипов("Дата"));
	ДанныеОЗагрузке.Колонки.Добавить("ПериодГрафикаПредставление", Новый ОписаниеТипов("Строка"));
	ДанныеОЗагрузке.Колонки.Добавить("ПараллельнаяЗагрузка",       Новый ОписаниеТипов("Булево"));
	ДанныеОЗагрузке.Колонки.Добавить("УчитыватьДоступность",       Новый ОписаниеТипов("Булево"));
	ДанныеОЗагрузке.Колонки.Добавить("Этап",                       Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2, СправочникСсылка.ЭтапыПроизводства"));
	ДанныеОЗагрузке.Колонки.Добавить("Распоряжение",        	   ОТРаспоряжение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//0
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоступностьВидовРабочихЦентровОбороты.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	ВЫБОР
	|		КОГДА ВидыРабочихЦентров.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
	|				ИЛИ ВидыРабочихЦентров.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
	|			ТОГДА НАЧАЛОПЕРИОДА(ДоступностьВидовРабочихЦентровОбороты.ДатаИнтервала, ДЕНЬ)
	|		ИНАЧЕ ДоступностьВидовРабочихЦентровОбороты.ДатаИнтервала
	|	КОНЕЦ КАК ПериодГрафика,
	|	ВидыРабочихЦентров.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
	|	ВидыРабочихЦентров.УчитыватьДоступностьПоГрафикуРаботы КАК УчитыватьДоступность,
	|	СУММА(ВЫБОР
	|			КОГДА ВидыРабочихЦентров.ВводитьДоступностьДляВидаРЦ
	|				ТОГДА ДоступностьВидовРабочихЦентровОбороты.ДоступностьПоВидуРЦОборот
	|			ИНАЧЕ ДоступностьВидовРабочихЦентровОбороты.ДоступностьПоРЦОборот
	|		КОНЕЦ) КАК Доступно
	|ИЗ
	|	РегистрНакопления.ДоступностьВидовРабочихЦентров.Обороты(
	|			,
	|			,
	|			,
	|			ДатаИнтервала МЕЖДУ &НачалоМесяца И &КонецМесяца
	|				И (&ЛюбойВидРабочегоЦентра
	|					ИЛИ ВидРабочегоЦентра В (&СписокВидовРабочихЦентров))) КАК ДоступностьВидовРабочихЦентровОбороты
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
	|	ПО ВидыРабочихЦентров.Ссылка = ДоступностьВидовРабочихЦентровОбороты.ВидРабочегоЦентра
	|ГДЕ
	|	(&ЛюбоеПодразделение
	|			ИЛИ ВидыРабочихЦентров.Подразделение В (&СписокПодразделений))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступностьВидовРабочихЦентровОбороты.ВидРабочегоЦентра,
	|	ВидыРабочихЦентров.ПараллельнаяЗагрузка,
	|	ВидыРабочихЦентров.УчитыватьДоступностьПоГрафикуРаботы,
	|	ВЫБОР
	|		КОГДА ВидыРабочихЦентров.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
	|				ИЛИ ВидыРабочихЦентров.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
	|			ТОГДА НАЧАЛОПЕРИОДА(ДоступностьВидовРабочихЦентровОбороты.ДатаИнтервала, ДЕНЬ)
	|		ИНАЧЕ ДоступностьВидовРабочихЦентровОбороты.ДатаИнтервала
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.РегистраторГрафикаПроизводства
	|			ТОГДА ТаблицаЗанятостьВидовРабочихЦентров.Распоряжение
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	//++ Локализация
	|				ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ЗаказНаПроизводство 
	//-- Локализация
	|			ТОГДА ТаблицаЗанятостьВидовРабочихЦентров.Регистратор
	//++ Локализация
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаЗанятостьВидовРабочихЦентров.Регистратор КАК Документ.МаршрутныйЛистПроизводства).Распоряжение
	//-- Локализация
	|	КОНЕЦ КАК Распоряжение,
	|	ВЫБОР
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.РегистраторГрафикаПроизводства
	|			ТОГДА ТаблицаЗанятостьВидовРабочихЦентров.Этап
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Этап,
	|	ТаблицаЗанятостьВидовРабочихЦентров.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВариантНаладки КАК ВариантНаладки,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ДатаИнтервала КАК ДатаИнтервала,
	|	ВидыРабочихЦентров.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
	|	ВидыРабочихЦентров.УчитыватьДоступностьПоГрафикуРаботы КАК УчитыватьДоступность,
	|	СУММА(ТаблицаЗанятостьВидовРабочихЦентров.Занято) КАК Занято
	|ПОМЕСТИТЬ ЗанятостьВидовРабочихЦентров
	|ИЗ
	|	РегистрНакопления.ДоступностьВидовРабочихЦентров КАК ТаблицаЗанятостьВидовРабочихЦентров
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
	|	ПО ВидыРабочихЦентров.Ссылка = ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра
	|ГДЕ
	|	(ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|			ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.РегистраторГрафикаПроизводства
	//++ Локализация
	|			ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ЗаказНаПроизводство			 
	|			ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.МаршрутныйЛистПроизводства
	//-- Локализация
	|	)
	|	И (&ЛюбойВидРабочегоЦентра
	|			ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра В (&СписокВидовРабочихЦентров))
	|	И ВЫБОР
	|			КОГДА (ВидыРабочихЦентров.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
	|					ИЛИ ВидыРабочихЦентров.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
	|					ИЛИ ВидыРабочихЦентров.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.День))
	|					И (ТаблицаЗанятостьВидовРабочихЦентров.ДатаИнтервала МЕЖДУ &НачалоДня И &КонецДня)
	|				ТОГДА ИСТИНА
	|			КОГДА ВидыРабочихЦентров.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Неделя)
	|					И (ТаблицаЗанятостьВидовРабочихЦентров.ДатаИнтервала МЕЖДУ &НачалоНедели И &КонецНедели)
	|				ТОГДА ИСТИНА
	|			КОГДА ВидыРабочихЦентров.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Месяц)
	|					И (ТаблицаЗанятостьВидовРабочихЦентров.ДатаИнтервала МЕЖДУ &НачалоМесяца И &КонецМесяца)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.РегистраторГрафикаПроизводства
	|			ТОГДА ТаблицаЗанятостьВидовРабочихЦентров.Распоряжение
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	//++ Локализация
	|				ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ЗаказНаПроизводство 
	//-- Локализация
	|			ТОГДА ТаблицаЗанятостьВидовРабочихЦентров.Регистратор
	//++ Локализация
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаЗанятостьВидовРабочихЦентров.Регистратор КАК Документ.МаршрутныйЛистПроизводства).Распоряжение
	//-- Локализация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.РегистраторГрафикаПроизводства
	|			ТОГДА ТаблицаЗанятостьВидовРабочихЦентров.Этап
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаЗанятостьВидовРабочихЦентров.КодСтрокиПродукция,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВариантНаладки,
	|	ВидыРабочихЦентров.ПараллельнаяЗагрузка,
	|	ВидыРабочихЦентров.УчитыватьДоступностьПоГрафикуРаботы,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ДатаИнтервала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗанятостьВидовРабочихЦентров.Распоряжение КАК Распоряжение,
	|	ТаблицаЗанятостьВидовРабочихЦентров.Этап КАК Этап,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВариантНаладки КАК ВариантНаладки,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение КАК Подразделение,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
	|	ТаблицаЗанятостьВидовРабочихЦентров.УчитыватьДоступность КАК УчитыватьДоступность,
	|	ВЫБОР
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
	|				ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.День)
	|		ИНАЧЕ ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования
	|	КОНЕЦ КАК ИнтервалПланирования,
	|	ВЫБОР
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
	|				ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТаблицаЗанятостьВидовРабочихЦентров.ДатаИнтервала, ДЕНЬ)
	|		ИНАЧЕ ТаблицаЗанятостьВидовРабочихЦентров.ДатаИнтервала
	|	КОНЕЦ КАК ПериодГрафика,
	|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	0 КАК Количество,
	|	ТаблицаЗанятостьВидовРабочихЦентров.Занято КАК Занято
	|ИЗ
	|	ЗанятостьВидовРабочихЦентров КАК ТаблицаЗанятостьВидовРабочихЦентров
	|ГДЕ
	|	ТаблицаЗанятостьВидовРабочихЦентров.Распоряжение ССЫЛКА Документ.ЭтапПроизводства2_2
	|	ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.Распоряжение ССЫЛКА Документ.ЗаказНаПроизводство2_2
	|
	//++ Локализация
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗанятостьВидовРабочихЦентров.Распоряжение КАК Распоряжение,
	|	ТаблицаЗанятостьВидовРабочихЦентров.Этап КАК Этап,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВариантНаладки КАК ВариантНаладки,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение КАК Подразделение,
	|	ТаблицаЗанятостьВидовРабочихЦентров.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
	|	ТаблицаЗанятостьВидовРабочихЦентров.УчитыватьДоступность КАК УчитыватьДоступность,
	|	ВЫБОР
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
	|				ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.День)
	|		ИНАЧЕ ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования
	|	КОНЕЦ КАК ИнтервалПланирования,
	|	ВЫБОР
	|		КОГДА ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Час)
	|				ИЛИ ТаблицаЗанятостьВидовРабочихЦентров.ВидРабочегоЦентра.Подразделение.ИнтервалПланирования = ЗНАЧЕНИЕ(Перечисление.ТочностьГрафикаПроизводства.Смена)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТаблицаЗанятостьВидовРабочихЦентров.ДатаИнтервала, ДЕНЬ)
	|		ИНАЧЕ ТаблицаЗанятостьВидовРабочихЦентров.ДатаИнтервала
	|	КОНЕЦ КАК ПериодГрафика,
	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
	|	ТаблицаПродукция.Характеристика КАК Характеристика,
	|	ТаблицаПродукция.Количество КАК Количество,
	|	ТаблицаЗанятостьВидовРабочихЦентров.Занято КАК Занято
	|ИЗ
	|	ЗанятостьВидовРабочихЦентров КАК ТаблицаЗанятостьВидовРабочихЦентров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.Продукция КАК ТаблицаПродукция
	|		ПО ((ВЫРАЗИТЬ(ТаблицаЗанятостьВидовРабочихЦентров.Распоряжение КАК Документ.ЗаказНаПроизводство)) = ТаблицаПродукция.Ссылка)
	|			И ТаблицаЗанятостьВидовРабочихЦентров.КодСтрокиПродукция = ТаблицаПродукция.КодСтроки
	|ГДЕ
	|	ТаблицаЗанятостьВидовРабочихЦентров.Распоряжение ССЫЛКА Документ.ЗаказНаПроизводство
	|	И ВЫРАЗИТЬ(ТаблицаЗанятостьВидовРабочихЦентров.Распоряжение КАК Документ.ЗаказНаПроизводство).Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство.Закрыт)
	|	И ТаблицаПродукция.ГрафикРассчитан
	//-- Локализация
	|";
	
	Запрос.УстановитьПараметр("ЛюбоеПодразделение",       Истина);
	Запрос.УстановитьПараметр("ЛюбойВидРабочегоЦентра",    Ложь);
	Запрос.УстановитьПараметр("СписокПодразделений",       Новый СписокЗначений);
	Запрос.УстановитьПараметр("СписокВидовРабочихЦентров", СписокВРЦ);
	
	// В зависимости от интервала планирования используется нужный период  
	
	Запрос.УстановитьПараметр("НачалоДня",    НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецДня",     КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("НачалоНедели", НачалоНедели(НачалоПериода));
	Запрос.УстановитьПараметр("КонецНедели",  КонецНедели(ОкончаниеПериода));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецМесяца",  КонецМесяца(ОкончаниеПериода));

	Результат = Запрос.ВыполнитьПакет();  
	
	ДоступностьВРЦ = Результат[0].Выгрузить();
	ДоступностьВРЦ.Индексы.Добавить("ВидРабочегоЦентра,ПериодГрафика");
	
	ЗанятостьВРЦ = Результат[2].Выгрузить();
	ЗанятостьВРЦ.Индексы.Добавить("ВидРабочегоЦентра,ПериодГрафика");
	
	СписокВидовРЦ = ЗанятостьВРЦ.Скопировать(,"Подразделение,ВидРабочегоЦентра,ИнтервалПланирования,ПараллельнаяЗагрузка,УчитыватьДоступность");
	СписокВидовРЦ.Свернуть("Подразделение,ВидРабочегоЦентра,ИнтервалПланирования,ПараллельнаяЗагрузка,УчитыватьДоступность");
	
	Для каждого СтрокаВидРЦ Из СписокВидовРЦ Цикл
		
		ТекущийПериод = ПланированиеПроизводстваКлиентСервер.НачалоИнтервалаПланирования(
										НачалоПериода, 
										СтрокаВидРЦ.ИнтервалПланирования);
										
		Пока ТекущийПериод <= ОкончаниеПериода Цикл
			
			СтруктураПоиска = Новый Структура("ВидРабочегоЦентра,ПериодГрафика", СтрокаВидРЦ.ВидРабочегоЦентра, ТекущийПериод);
		 	НайденнаяЗанятостьВРЦ = ЗанятостьВРЦ.НайтиСтроки(СтруктураПоиска);
		 	НайденнаяДоступностьВРЦ = ДоступностьВРЦ.НайтиСтроки(СтруктураПоиска);
			
			Если НайденнаяЗанятостьВРЦ.Количество() <> 0 Тогда
				Для каждого ВыборкаЗанятостьВРЦ Из НайденнаяЗанятостьВРЦ Цикл
					СтрокаДанные = ДанныеОЗагрузке.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДанные, ВыборкаЗанятостьВРЦ);
					СтрокаДанные.ПериодГрафика = ТекущийПериод;
					СтрокаДанные.ПериодГрафикаПредставление = ОперативныйУчетПроизводства.ИнтервалПланированияСтрокой(
																					СтрокаДанные.ПериодГрафика, 
																					СтрокаВидРЦ.ИнтервалПланирования);
																					
					Если НайденнаяДоступностьВРЦ.Количество() <> 0 Тогда
						СтрокаДанные.Доступно = НайденнаяДоступностьВРЦ[0].Доступно;
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли;
			
			СкрыватьИнтервалыБезЗагрузки = Ложь;
			
			Если НЕ СкрыватьИнтервалыБезЗагрузки ИЛИ НайденнаяЗанятостьВРЦ.Количество() <> 0 И НайденнаяДоступностьВРЦ.Количество() <> 0 Тогда
				
				СтрокаДанные = ДанныеОЗагрузке.Добавить();
				СтрокаДанные.ВидРабочегоЦентра = СтрокаВидРЦ.ВидРабочегоЦентра;
				СтрокаДанные.Подразделение = СтрокаВидРЦ.Подразделение;
				СтрокаДанные.ПериодГрафика = ТекущийПериод;
				СтрокаДанные.ПараллельнаяЗагрузка = СтрокаВидРЦ.ПараллельнаяЗагрузка;
				СтрокаДанные.УчитыватьДоступность = СтрокаВидРЦ.УчитыватьДоступность;
				
				СтрокаДанные.ПериодГрафикаПредставление = ОперативныйУчетПроизводства.ИнтервалПланированияСтрокой(
																				СтрокаДанные.ПериодГрафика, 
																				СтрокаВидРЦ.ИнтервалПланирования);
																				
				Если НайденнаяДоступностьВРЦ.Количество() <> 0 Тогда
					СтрокаДанные.Доступно = НайденнаяДоступностьВРЦ[0].Доступно;
				КонецЕсли; 
				
			КонецЕсли;
			ТекущийПериод = ПланированиеПроизводстваКлиентСервер.ОкончаниеИнтервалаПланирования(ТекущийПериод, СтрокаВидРЦ.ИнтервалПланирования) + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	втЗанято.ВидРабочегоЦентра КАК ВидРабочегоЦентра
	                      |ПОМЕСТИТЬ втЗанято
	                      |ИЗ
	                      |	&втЗанято КАК втЗанято
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	                      |	вт.Доступно КАК Доступно,
	                      |	вт.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
	                      |	вт.УчитыватьДоступность КАК УчитыватьДоступность
	                      |ПОМЕСТИТЬ вт
	                      |ИЗ
	                      |	&втДоступно КАК вт
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	                      |	вт.УчитыватьДоступность КАК УчитыватьДоступность,
	                      |	вт.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
	                      |	МАКСИМУМ(вт.Доступно) КАК Доступно,
	                      |	0 КАК Занято,
	                      |	&ПериодГрафика КАК ПериодГрафика
	                      |ИЗ
	                      |	вт КАК вт
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втЗанято КАК втЗанято
	                      |		ПО вт.ВидРабочегоЦентра = втЗанято.ВидРабочегоЦентра
	                      |ГДЕ
	                      |	вт.ВидРабочегоЦентра ССЫЛКА Справочник.ВидыРабочихЦентров
	                      |	И вт.ВидРабочегоЦентра <> ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)
	                      |	И втЗанято.ВидРабочегоЦентра ЕСТЬ NULL
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт.ВидРабочегоЦентра,
	                      |	вт.УчитыватьДоступность,
	                      |	вт.ПараллельнаяЗагрузка");
	Запрос.УстановитьПараметр("втДоступно", ДоступностьВРЦ);
	Запрос.УстановитьПараметр("втЗанято", ДанныеОЗагрузке); 
	Запрос.УстановитьПараметр("ПериодГрафика", НачалоДня(ТекущаяДатаСеанса()));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		нов = ДанныеОЗагрузке.Добавить();
		ЗаполнитьЗначенияСвойств(нов, Выборка);
	КонецЦикла;
	
	Возврат ДанныеОЗагрузке;

КонецФункции
 
Функция ПолучитьОсновноеОборудованиеПоСпецификации(знач Спецификация) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [28.04.2026 18:39:44] +        
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ЭтапыПроизводстваВидыРабочихЦентров.ВидРабочегоЦентра КАК ВидРабочегоЦентра
	                      |ИЗ
	                      |	Справочник.ЭтапыПроизводства.ВидыРабочихЦентров КАК ЭтапыПроизводстваВидыРабочихЦентров
	                      |ГДЕ
	                      |	ЭтапыПроизводстваВидыРабочихЦентров.Ссылка.Владелец = &Спецификация"); 
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ВидРабочегоЦентра;
	Иначе
		Результат = Справочники.ВидыРабочихЦентров.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [28.04.2026 18:39:44] -
КонецФункции

Функция ПолучитьКодОперацииПоСпецификации(знач Спецификация) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [29.04.2026 0:39:45] +        
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	ЭтапыПроизводства.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ втЭтапСправочник
	                      |ИЗ
	                      |	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	                      |ГДЕ
	                      |	ЭтапыПроизводства.Владелец = &Спецификация
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТехнологическиеОперации.бит_КодОперации КАК бит_КодОперации
	                      |ИЗ
	                      |	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЭтапСправочник КАК втЭтапСправочник
	                      |		ПО (втЭтапСправочник.Ссылка = ТехнологическиеОперации.Владелец)
	                      |ГДЕ
	                      |	ТехнологическиеОперации.Спецификация = &Спецификация
	                      |	И ТехнологическиеОперации.Спецификация.ОсновноеИзделиеНоменклатура = &ОсновноеИзделиеНоменклатура
	                      |");
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", Спецификация.ОсновноеИзделиеНоменклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.бит_КодОперации;
	Иначе
		Результат = Справочники.бит_КодыОпераций.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [29.04.2026 0:39:45] -	
КонецФункции
